tutorials/pimpleHFDIBFoam/Immersed-BeamBend/ImmersedCyl-CustomBend-Re20-Mesh20000-Tester/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              nu  [0 2 -1 0 0 0 0] 0.101475;   // Re=20 with U=1 and D=1
rho             rho [1 -3 0 0 0 0 0] 1000;
// ************************************************************************* //
